_br-ode-1.X.svn/axis2-war/src/test/resources/TestThrowOnEvent/OnEventCorrelation.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:tns="http://sample.bpel.org/bpel/sample" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" name="OnEventCorrelation" targetNamespace="http://sample.bpel.org/bpel/sample">
  <types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://sample.bpel.org/bpel/sample" schemaLocation="OnEventCorrelation.xsd"/>
        </xsd:schema>
  </types>
  <message name="OnEventCorrelationRequestMessage">
    <part element="tns:OnEventCorrelationRequest" name="payload">
    </part>
  </message>
  <message name="OnEventCorrelationResponseMessage">
    <part element="tns:OnEventCorrelationResponse" name="payload">
    </part>
  </message>
  <portType name="OnEventCorrelation">
    <operation name="initiate">
      <input message="tns:OnEventCorrelationRequestMessage">
    </input>
    </operation>
  </portType>
  <binding name="OnEventCorrelationBinding" type="tns:OnEventCorrelation">
    <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="initiate">
      <wsdlsoap:operation soapAction=""/>
      <input>
        <wsdlsoap:body use="literal"/>
      </input>
    </operation>
  </binding>
  <service name="OnEventCorrelation">
    <port binding="tns:OnEventCorrelationBinding" name="OnEventCorrelation">
      <wsdlsoap:address location="http://localhost:8888/ode/processes/OnEventCorrelation/"/>
    </port>
  </service>
    <plnk:partnerLinkType name="OnEventCorrelation">
        <plnk:role name="OnEventCorrelationProvider" portType="tns:OnEventCorrelation"/>
    </plnk:partnerLinkType>
</definitions>